package com.company.epam.arrayCharacters;

import java.util.Scanner;

public class ArrayOfCharacters {

    // Дан массив названий переменных в camelCase. Преобразовать названия в snake_case.
    public static void task1() {

    }

    // Замените в строке все вхождения 'word' на 'letter'.
    public static void task2() {
        Scanner scanner = new Scanner(System.in);
        String str = scanner.nextLine();
        System.out.println(str);
        str = str.replace("word", "letter");
        System.out.println(str);
    }

    // В строке найти количество цифр.
    public static void task3() {

    }

    // В строке найти количество чисел.
    public static void task4() {

    }

    // Удалить в строке все лишние пробелы, то есть серии подряд идущих пробелов заменить на одиночные пробелы.
    // Крайние пробелы в строке удалить.
    public static void task5() {

    }

}
